       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATRICE.
       AUTHOR.    MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  WS-OPERANDE-1  PIC 9(2)    VALUE ZEROS.
       01  WS-OPERANDE-2  PIC 9(2)    VALUE ZEROS.
       01  WS-OPERATEUR   PIC X(1)    VALUE SPACES.
       01  WS-RESULTAT    PIC 9(3)V99 VALUE ZEROS.

       PROCEDURE DIVISION.

           DISPLAY "DONNER LE PREMIER OPERANDE".
           ACCEPT WS-OPERANDE-1.

           DISPLAY "DONNER L'OPERATEUR (+, *, -, /)".
           ACCEPT WS-OPERATEUR.

           DISPLAY "DONNER LE DEUSIEME OPERANDE".
           ACCEPT WS-OPERANDE-2.

           EVALUATE WS-OPERATEUR
                WHEN "+" ADD WS-OPERANDE-1 TO WS-OPERANDE-2
                           GIVING WS-RESULTAT
                WHEN "-" SUBTRACT WS-OPERANDE-1 FROM WS-OPERANDE-2
                           GIVING WS-RESULTAT
                WHEN "*" MULTIPLY WS-OPERANDE-1 BY WS-OPERANDE-2
                           GIVING WS-RESULTAT
                WHEN "/" DIVIDE WS-OPERANDE-1 INTO WS-OPERANDE-2
                           GIVING WS-RESULTAT
                WHEN OTHER DISPLAY "OPERATEUR NON VALIDE"
           END-EVALUATE.

           DISPLAY "LE RESULTAT DE CALCUL EST :"WS-RESULTAT.

       STOP RUN.

       END PROGRAM CALCULATRICE.
