       IDENTIFICATION DIVISION.
       PROGRAM-ID. CALCULATRICE-2.
       AUTHOR.    MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  WS-OPERANDE-1  PIC 9(2) .
       01  WS-OPERANDE-2  PIC 9(2)  .
       01  WS-RESULTAT    PIC 9(3)V99 .
       01  WS-OPERATEUR   PIC X(1)  .
           88 WS-OPERATEUR-VALID   VALUES '+','-','*','/'  .

       PROCEDURE DIVISION.

           PERFORM SAISIE-OPERANDES THRU FIN-SAISIE-OPERANDES.
           PERFORM SAISIE-OPERATEUR THRU FIN-SAISIE-OPERATEUR.

           EVALUATE WS-OPERATEUR
            WHEN "+"
              PERFORM ADDITION THRU FIN-ADDITION

            WHEN "*"
              PERFORM MULTIPLICATION THRU FIN-MULTIPLICATION

            WHEN "/"
              PERFORM DIVITION THRU FIN-DIVITION

            WHEN "-"
              PERFORM SOUSTRACTION THRU FIN-SOUSTRACTION

            WHEN
             OTHER
              PERFORM SAISIE-OPERATEUR THRU FIN-SAISIE-OPERATEUR
           END-EVALUATE.

              STOP RUN.


           SAISIE-OPERANDES.
           DISPLAY "DONNER LE PREMIER OPERANDE".
           ACCEPT WS-OPERANDE-1.
           DISPLAY "DONNER LE DEUSXIEME OPERANDE".
           ACCEPT WS-OPERANDE-2.
           FIN-SAISIE-OPERANDES.
           EXIT.

           SAISIE-OPERATEUR.
           PERFORM UNTIL WS-OPERATEUR-VALID
                      DISPLAY "DONNER L'OPERATEUR (+, *, -, /)"
           ACCEPT WS-OPERATEUR
           END-PERFORM.
           FIN-SAISIE-OPERATEUR.
           EXIT.

           ADDITION.
           COMPUTE WS-RESULTAT = WS-OPERANDE-1 + WS-OPERANDE-2.
           DISPLAY "LA RESULTAT EST :" WS-RESULTAT.

           FIN-ADDITION.
           EXIT.

           MULTIPLICATION.
           COMPUTE WS-RESULTAT = WS-OPERANDE-1 * WS-OPERANDE-2.
           DISPLAY "LA RESULTAT EST :" WS-RESULTAT.

           FIN-MULTIPLICATION.
           EXIT.

           DIVITION.
           COMPUTE WS-RESULTAT = WS-OPERANDE-1 / WS-OPERANDE-2.
           DISPLAY "LA RESULTAT EST :" WS-RESULTAT.

           FIN-DIVITION.
           EXIT.

           SOUSTRACTION.
           COMPUTE WS-RESULTAT = WS-OPERANDE-1 - WS-OPERANDE-2.
           DISPLAY "LA RESULTAT EST :" WS-RESULTAT.

           FIN-SOUSTRACTION.
           EXIT.

       END PROGRAM CALCULATRICE-2.
