
       IDENTIFICATION DIVISION.
       PROGRAM-ID. FIND-CARACTERE.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  PHRASE.
           05  WS-CHAINE PIC X(20).
           05  WS-NBR-CAR PIC 9(2).
       01  WS-NBR-POS PIC 9(2).
       01  WS-CARACTERE PIC X.


       PROCEDURE DIVISION.

       DISPLAY "DONNER UNE CHAINE DE CARACTERE".
       ACCEPT WS-CHAINE.

       DISPLAY "DONNER UN CARACTERE".
       ACCEPT WS-CARACTERE.

       MOVE FUNCTION LENGTH (WS-CHAINE) TO WS-NBR-CAR.

           DISPLAY WS-NBR-CAR.

       PERFORM VARYING WS-NBR-POS FROM 1 BY 1
                  UNTIL WS-NBR-POS > WS-NBR-CAR
                 OR WS-CHAINE(WS-NBR-POS:1) = WS-CARACTERE
       END-PERFORM

       IF WS-NBR-POS > WS-NBR-CAR
            DISPLAY "LE CARACTERE N'EXISTE PAS"
       ELSE
            DISPLAY "LE CARACTERE EST AU POSITION " WS-NBR-POS
       END-IF

       STOP RUN.

       END PROGRAM FIND-CARACTERE.
