       IDENTIFICATION DIVISION.
       PROGRAM-ID. DEC-TAB.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  TABLEAU.
         05  LIGNE-TAB PIC X(8) OCCURS 5 TIMES.

       01  TABLEAU-2.
         05 LIGNE-TB  OCCURS 5 TIMES.
           10  COLONNE-TAB PIC X(5) OCCURS 5 TIMES.

       01  TABLEAU-3.
         05 LIGNE-TAB OCCURS 3 TIMES.
           10 COLONNE-TAB OCCURS 5 TIMES.
             15 PERSONNE.
                20 NOM  PIC X(10).
                20 PRENOM PIC X(10).


       PROCEDURE DIVISION.

        STOP RUN.

       END PROGRAM DEC-TAB.
