       IDENTIFICATION DIVISION.
       PROGRAM-ID. RECTENGLE.
       AUTHOR. MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  WS-LONGEUR   PIC  9(2)V99.
       01  WS-LARGEUR   PIC  9(2)V99.
       01  WS-PERIMETRE PIC  9(3)V99.
       01  WS-AIR       PIC  9(3)V99.

       PROCEDURE DIVISION.

       DISPLAY "DONNER LA LARGUEUR".
       ACCEPT WS-LARGEUR.

       DISPLAY "DONNER LA LONGUER".
       ACCEPT WS-LONGEUR.

       MULTIPLY WS-LONGEUR BY WS-LARGEUR GIVING WS-AIR.
       COMPUTE WS-PERIMETRE = 2*WS-LONGEUR + 2*WS-LARGEUR.

       DISPLAY WS-AIR.
       DISPLAY WS-PERIMETRE.

       GOBACK.

       END PROGRAM RECTENGLE.
