
       IDENTIFICATION DIVISION.

       PROGRAM-ID. YOUR-PROGRAM-NAME.
       ENVIRONMENT DIVISION.

       DATA DIVISION.

       WORKING-STORAGE SECTION.

       01 WS-WEIGTH  PIC 999.
       01 WS-HEITGH  PIC 999.
       01 WS-BMI     PIC 999V99.

       PROCEDURE DIVISION.

       MAIN-PROCEDURE.

           DISPLAY "DONNER VOTRE POID :".
           ACCEPT WS-WEIGTH.

           DISPLAY "DONNER VOTRE TAILLE".
           ACCEPT WS-HEITGH.

           COMPUTE WS-BMI = WS-WEIGTH * 703 / (WS-HEITGH * WS-HEITGH).

           DISPLAY "VOTRE BMI EST :" WS-BMI.

            STOP RUN.

       END PROGRAM YOUR-PROGRAM-NAME.
