       IDENTIFICATION DIVISION.
       PROGRAM-ID. INTERVALLE.
       AUTHOR.    MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  WS-NUMBER PIC 9(2).

       PROCEDURE DIVISION.

           PERFORM UNTIL WS-NUMBER >= 10 AND WS-NUMBER <=20
             DISPLAY "DONNER UN ENTIER"
             ACCEPT WS-NUMBER

             IF WS-NUMBER <10 OR WS-NUMBER >20
               DISPLAY "ENCORE UNE FOIS !"
             ELSE
               DISPLAY " BRAVO ! VOUS AVEZ SAISI : " WS-NUMBER
           END-PERFORM.

           STOP RUN.

       END PROGRAM INTERVALLE.
