IDENTIFICATION DIVISION.
PROGRAM-ID. VERIFY-MAJUSCULES.

DATA DIVISION.
WORKING-STORAGE SECTION.
01 WORD PIC X(20) VALUE "HELLO".
01 INDEX PIC 9(3) VALUE 1.
01 LENGTH PIC 9(3).

PROCEDURE DIVISION.
MAIN-LOGIC.
    MOVE LENGTH OF WORD TO LENGTH
    PERFORM VERIFY-MAJUSCULES UNTIL INDEX > LENGTH
    DISPLAY "Le mot contient uniquement des majuscules."
    STOP RUN.

VERIFY-MAJUSCULES.
    IF NOT (WORD(INDEX:1) >= "A" AND WORD(INDEX:1) <= "Z")
        DISPLAY "Le mot ne contient pas uniquement des majuscules."
        STOP RUN
    END-IF
    ADD 1 TO INDEX.
