       IDENTIFICATION DIVISION.
       PROGRAM-ID. MOYENNE.
       AUTHOR.    MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  NBR-ETU PIC 9(2).
       01  TOTAL   PIC 9 (5).
       01  MOYENNE PIC 9(2)V99.
       01  NOTE-ETU.
           05 NOTE PIC 9(2) OCCURS 5 TIMES.

       PROCEDURE DIVISION.

       MOVE ZERO TO NBR-ETU.
       MOVE ZERO TO TOTAL.

       PERFORM VARYING NBR-ETU FROM 1 BY 1
           UNTIL NBR-ETU > 5

           DISPLAY "ENTRER LA NOTE DE L'ETUDIANT N° " NBR-ETU
           ACCEPT NOTE(NBR-ETU)
           ADD NOTE(NBR-ETU) TO TOTAL
       END-PERFORM

        DIVIDE TOTAL BY 5 GIVING MOYENNE.

           DISPLAY "LA MOYENNE DE LA CLASSE EST :" MOYENNE
           STOP RUN.

       END PROGRAM MOYENNE.
