       IDENTIFICATION DIVISION.
       PROGRAM-ID. N-PREMIER.
       AUTHOR.    MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  WS-N      PIC 9(3) VALUE ZEROS.
       01  WS-SOMME  PIC 9(3) VALUE ZEROS.
       01  WS-COUNTER  PIC 9(3) VALUE ZEROS.

       PROCEDURE DIVISION.

       PERFORM  UNTIL WS-N >0 AND WS-N < 100
         DISPLAY "DONNER UN ENTIER N "
         ACCEPT WS-N
       END-PERFORM

       PERFORM VARYING WS-COUNTER FROM 1 BY 1  UNTIL  WS-COUNTER > WS-N

           ADD WS-COUNTER TO WS-SOMME

           END-PERFORM

           DISPLAY WS-SOMME.

           STOP RUN.



       END PROGRAM N-PREMIER.
