       IDENTIFICATION DIVISION.
       PROGRAM-ID. OCCURENCE.
       AUTHOR.    MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.
       01  WS-NUMBER  PIC 9(10)  VALUE ZEROS.
       01  WS-NUM     PIC 9(1)  VALUE ZEROS.
       01  WS-RESTE   PIC 9(1)  VALUE ZEROS.
       01  WS-COUNTER PIC 9(2)  VALUE ZEROS.

        PROCEDURE DIVISION.

       DISPLAY "DONNER UN NOMBRE ENTIER"
       ACCEPT  WS-NUMBER.

       DISPLAY "DONNER UN ENTIER A CHERCHER"
       ACCEPT  WS-NUM.

       PERFORM COMPTEUR-BOUCLE UNTIL WS-NUMBER = ZERO.
           DISPLAY "L'ENTIER " WS-NUM " APPARAIT "WS-COUNTER" FOIS".

           STOP RUN.

           COMPTEUR-BOUCLE.
           DIVIDE WS-NUMBER BY 10 GIVING WS-NUMBER REMAINDER WS-RESTE.
           IF WS-RESTE = WS-NUM
               ADD 1 TO WS-COUNTER
           END-IF.

       END PROGRAM OCCURENCE.
