       IDENTIFICATION DIVISION.
       PROGRAM-ID. PARITE.
       AUTHOR.    MOHAMED.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.

       01  WS-NUMBER-1 PIC 9(3) VALUE ZEROS.
       01  WS-NUMBER-2 PIC 9(3) VALUE ZEROS.
       01  WS-TEMP     PIC 9(3) VALUE ZEROS.
       01  WS-RESULT   PIC 9(3) VALUE ZEROS.
       01  WS-MID      PIC 9(3) VALUE ZEROS.

       PROCEDURE DIVISION.

           DISPLAY "DONNER UN ENTIER A"
           ACCEPT WS-NUMBER-1

           DISPLAY "DONNER UN ENTIER B"
           ACCEPT WS-NUMBER-2

           IF WS-NUMBER-1 < WS-NUMBER-2
               DIVIDE WS-NUMBER-1 BY 2 GIVING WS-TEMP
           ELSE
               DIVIDE WS-NUMBER-2 BY 2 GIVING WS-TEMP
           END-IF

                DISPLAY WS-TEMP.

           PERFORM VARYING WS-RESULT FROM WS-TEMP BY -1
                 UNTIL FUNCTION MOD(WS-NUMBER-1,WS-RESULT)=0
                  AND  FUNCTION MOD(WS-NUMBER-2,WS-RESULT)=0
           END-PERFORM

           DISPLAY "LE PGCD EST :" WS-RESULT

           STOP RUN.

       END PROGRAM PARITE.
