       IDENTIFICATION DIVISION.
       PROGRAM-ID. PGM-TEST.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       INPUT-OUTPUT SECTION.

       DATA DIVISION.
       FILE SECTION.
       WORKING-STORAGE SECTION.


       01  WS-SALAIRE  PIC 9(3)V99.
       01  WS-ANCIENTE PIC 9(2).
       01  WS-PRIME    PIC 9(4)V99.

       PROCEDURE DIVISION.

       DISPLAY "DONNEE LE SALAIRE DE L'EMPLOYER"
       ACCEPT  WS-SALAIRE.


       DISPLAY "DONNEE L'ENCIENTE DE L'EMPLOYER"
       ACCEPT  WS-ANCIENTE.

       IF WS-ANCIENTE < 5

           COMPUTE WS-PRIME = WS-SALAIRE *1.1

       ELSE IF WS-ANCIENTE >= 5 AND WS-ANCIENTE <10

          COMPUTE WS-PRIME = WS-SALAIRE * 1.15

       ELSE IF WS-ANCIENTE >= 10 AND WS-ANCIENTE <20

          COMPUTE WS-PRIME =WS-SALAIRE * 1.20

       ELSE

           COMPUTE WS-PRIME = WS-SALAIRE * 1.50

       END-IF.

           DISPLAY "LE SALAIRE EST :" WS-PRIME.

       STOP RUN.

       END PROGRAM PGM-TEST.
